{
    "courses": [
        {
            "number": "CS107",
            "hours": "4",
            "meta": "Introduction to Computing and Programming",
            "description": "Access and use of computing resources. Programming and program design. Problem solving. Data types, control structures, modularity, information hiding. Course Information: Credit is not given for CS 107 if the student has credit for CS 102. Previously listed as EECS 171.",
            "schedule": "To be properly registered, students must enroll in one Laboratory and one Lecture.",
            "prerequisites": [
                {
                    "prerequisite": "Credit or concurrent registration in MATH 180."
                }
            ],
            "CRN": "17412",
            "professor": "Reckinger, Scott"
        },
        {
            "number": "CS109",
            "hours": "3",
            "meta": "Programming for Engineers with MatLab.",
            "description": "Program design and problem solving using MATLAB; numeric computation; data types and operators; control structures; functions; file I/O; arrays and structures; engineering applications:matrices and equation solution; programming assignments. Course Information: Credit is not given for CS 109 if the student has credit for CS 110. Extensive computer use required.",
            "schedule": "To be properly registered, students must enroll in one Laboratory-Discussion and one Lecture-Discussion.",
            "prerequisites": [
                {
                    "prerequisite": "Credit or concurrent registration in MATH 180."
                }
            ],
            "CRN": "44904",
            "professor": "Mark Grechanik"
        },
        {
            "number": "CS111",
            "hours": "3",
            "meta": "Program Design I",
            "description": "Introduction to programming: control structures; variables and data types; problem decomposition and procedural programming; input and output; aggregate data structures including arrays; programming exercises. Course Information: 3 hours. Previously listed as CS 101. Extensive computer use required. Credit is not given for CS 111 if student has credit in CS 112 or CS 113.",
            "schedule": "To be properly registered, students must enroll in one Laboratory and one Lecture-Discussion.",
            "prerequisites": [],
            "CRN": "34013",
            "professor":"Reckinger, Shanon"
        },
        {
            "number": "CS141",
            "hours": "3",
            "meta": "Program Design II",
            "description": "Data abstraction and modular design; recursion; lists and stacks; dynamic memory allocation; file manipulation; programming exercises. Course Information: 3 hours. Previously listed as CS 102. Extensive computer use required.",
            "schedule": "To be properly registered, students must enroll in one Laboratory-Discussion and one Lecture-Discussion.",
            "prerequisites": [
                {
                    "prerequisite": "CS109"
                },
                {
                    "prerequisite": "CS111"
                },
                {
                    "prerequisite": "Concurrent or credit for Math 180,appropriate score on the department placement test."
                }
            ],
            "CRN": "34447",
            "professor": "David Hayes"
        }
    ]
}
